print("Привет мир!")

print("Привет программист!")

print(2+2)
print(10/3)

name = 'Dima'

print(name)

v = input('Введите число от 1 до 10:\n')
print(int(v) + 10)

name = input('Введите ваше имя:\n')
print(f'Привет, {name}! Как дела?')

"""Практика: Приведение типов
Выведите на экран при помощи print() результат работы:"""
print(float('1'))
print(bool(1)) 
print(bool(''))
print(bool(0)) 
print(int(float('2.5')))
